{
    "earth": {
        "video": "https://images.nasa.gov/details/Earth%20Views%20from%20the%20International%20Space%20Station",
        "description": "Earth, the third planet from the Sun, is unique in the solar system as a water world, with 70.8% of its surface covered by a global ocean and the remaining 29.2% comprising landmasses. Its tectonic plates create geological features like mountains and volcanoes, while the planet's liquid outer core generates a protective magnetosphere. Earth's dynamic atmosphere, primarily composed of nitrogen and oxygen, maintains surface conditions and shields against meteoroids and UV radiation. It has a slightly flattened shape, is the densest planet among the rocky ones, and orbits the Sun, experiencing seasons due to its tilted axis. Earth's natural satellite, the Moon, causes tides and stabilizes its rotation. Over billions of years, Earth has fostered life, including humanity, which has now become a major influence on the planet, impacting the environment and climate in ways that pose significant threats to both human and other forms of life."
    },
    "moon": {
        "video": "https://images.nasa.gov/details/NHQ_2018_0131_Super%20Blue%20Moon%20Lunar%20Eclipse",
        "description": "The Moon is Earth's sole natural satellite, residing at an average distance of 384,400 km, nearly 30 times the Earth's diameter, and is tidally locked, always presenting the same side to Earth. Its mass is approximately one-sixth of Earth's, with a surface gravity of 0.1654 g, making it one of the densest satellites in the Solar System. Formed 4.51 billion years ago from a colossal impact with a Mars-sized object called Theia, the Moon is marked by impact craters and dark maria plains formed from heating during impacts on its far side. It has played a profound role in human culture, knowledge, and exploration, with significant milestones including Luna 2's 1959 impact, Luna 9's 1966 soft landing, and the historic Apollo 11 mission that saw the first human landing in 1969. Robotic exploration continues, with planned crewed missions set to return in the late 2020s."
    },
    "mercury": {
        "video": "https://images.nasa.gov/details/GSFC_20160509_Mercury_m12235_Transit2016",
        "description": "Mercury, the closest and smallest planet in the Solar System, is a terrestrial world marked by a heavily cratered surface and an extremely thin exosphere, lacking geological activity. Despite its small size, it possesses a density that gives it a similar surface gravity to Mars. Mercury boasts a dynamic magnetic field, albeit much weaker than Earth's, and has no natural moons. It is believed to have a solid silicate crust and mantle, overlying solid and liquid cores. With a scant atmosphere, Mercury's surface experiences extreme temperature variations, from -173°C at night to 427°C during the day at the equator. Water ice reservoirs exist in permanently shadowed polar regions. Its slow rotation results in a unique spin-orbit resonance, where one Mercurian day lasts 176 Earth days, and its orbital eccentricity is the highest among the planets. Positioned close to the Sun, Mercury is visible from Earth as either a morning or evening star and is named after the Roman god Mercurius. Due to its proximity to the Sun, reaching Mercury with a spacecraft is challenging, with only three missions having visited it as of 2023: Mariner 10, MESSENGER, and BepiColombo."
    },
    "venus": {
        "video": "https://images.nasa.gov/details/NASA's%20Return%20to%20Venus",
        "description": "Venus, the second planet from the Sun, is an intriguing world with a dense atmosphere and a surface temperature hot enough to melt lead. It's often seen as the \"evening star\" or \"morning star\" due to its brightness in Earth's sky. While Venus shares similarities with Earth in size and mass, its harsh conditions make it inhospitable. The planet has a thick carbon dioxide atmosphere and extreme greenhouse effect, leading to scorching temperatures and crushing pressure at the surface. Although there's evidence of possible life-friendly conditions in Venus's cloud layers, it's not conclusive. Venus's slow, retrograde rotation and unique orbit make its days and years longer than any other planet. It's one of the hottest spots in the solar system and has been the focus of early interplanetary missions, revealing its harsh environment. Future missions aim to learn more about Earth-like planets and their potential habitability."
    },
    "mars": {
        "video": "https://images.nasa.gov/details/JPL-20211115-MARSf-0001-Hows%20the%20Weather%20on%20Mars",
        "description": "Mars, known as the \"Red Planet,\" is the fourth terrestrial planet in the Solar System, characterized by its reddish surface due to iron oxide dust. It has a radius of 3,389.5 km and exhibits a surface dichotomy, with the northern hemisphere being flatter and lower than the southern hemisphere. Mars has a thin atmosphere primarily composed of carbon dioxide and two small, irregularly shaped moons, Phobos and Deimos. The planet is geologically active, experiencing dust devils and marsquakes, with prominent features like Olympus Mons, a massive shield volcano, and Valles Marineris, one of the largest canyons in the Solar System. Its elliptical orbit and axial tilt lead to pronounced seasonal changes, with surface temperatures ranging from -110°C to 35°C. A Martian day lasts 24.5 hours, and its year is 1.88 Earth years long. Mars, formed about 4.5 billion years ago, has undergone different geological periods, and while there are hints of past water presence, the question of whether life ever existed there remains unanswered. Mars has been a subject of observation for centuries due to its brightness, and space exploration has been ongoing since the late 20th century, with the prospect of human missions to the planet on the horizon."
    },
    "jupiter": {
        "video": "https://images.nasa.gov/details/GSFC_20180313_Jupiter_m12878_GreatRedSpot",
        "description": "Jupiter, the fifth planet from the Sun and the largest in the Solar System, is a massive gas giant with a mass exceeding that of all other planets combined and a slightly smaller mass than the Sun. It orbits the Sun at a distance of 5.20 astronomical units, with an orbital period of 11.86 years. Jupiter, named after the chief deity of ancient Roman religion, is the third brightest natural object in Earth's night sky, observed since ancient times. This giant planet played a pivotal role in the early Solar System, forming first and influencing the development of other planets. Comprising primarily hydrogen and helium, its interior generates more heat than it receives from the Sun. Jupiter's internal structure consists of an outer mantle of liquid metallic hydrogen and a denser inner core. Its rapid rotation results in an oblate spheroid shape with a noticeable equatorial bulge. The planet's atmosphere displays a distinctive pattern of latitudinal bands, hosting the famous Great Red Spot, a massive storm in existence since 1831. Jupiter has a faint ring system and a powerful magnetosphere, making it the second-largest structure in the Solar System after the heliosphere. With 95 known moons and possibly more, including the four large Galilean moons discovered by Galileo Galilei in 1610, Jupiter boasts a diverse moon system, with Ganymede surpassing Mercury in size. It has been visited by nine robotic probes since 1973, with more missions planned."
    },
    "saturn": {
        "video": "https://images.nasa.gov/details/GSFC_20181217_Saturn_m12672_Rings",
        "description": "Saturn, the sixth planet from the Sun and the Solar System's second-largest, following Jupiter, is a gas giant with a remarkable size, boasting an average radius nearly ten times that of Earth. Despite having only one-eighth of Earth's density, it remarkably surpasses our planet in mass by over 95 times. Saturn's interior is believed to consist of a rocky core, encased by layers of metallic hydrogen, liquid hydrogen, liquid helium, and a gaseous outer layer. This planet's pale yellow appearance results from ammonia crystals in its upper atmosphere, and it possesses a planetary magnetic field generated by an electrical current within the metallic hydrogen layer, which, although weaker than Earth's, boasts a magnetic moment 580 times greater due to Saturn's vast size. Saturn's magnetic field strength is about one-twentieth that of Jupiter. Its outer atmosphere may appear subdued, but it can feature long-lasting features, and its winds can reach staggering speeds of up to 1,800 kilometers per hour. Saturn is renowned for its prominent ring system, predominantly composed of ice particles, with some rocky debris and dust. The planet hosts an extensive moon system, with at least 146 known moons, 63 of which have official names. Titan, the largest moon and the second-largest in the Solar System, is even more substantial (though less massive) than the planet Mercury and notably boasts a substantial atmosphere, making it the only moon in the Solar System with this characteristic."
    },
    "uranus": {
        "video": "https://images.nasa.gov/details/JPL-19860124-VOYAGEf-0001-AVC2002151%20First%20Spacecraft%20at%20Uranus",
        "description": "Uranus, the seventh planet from the Sun, is a unique icy gas giant with a complex layered atmosphere featuring frigid temperatures and extreme weather patterns. It has a remarkable axial tilt of 97.8 degrees and rotates in reverse. Uranus boasts the third-largest diameter and fourth-largest mass in the Solar System, with a rocky core surrounded by a hydrogen and helium-rich atmosphere. This enigmatic planet has a dim ring system, 13 inner moons, and five major ones. Its magnetic field is uneven, contributing to the darkening of its rings and moons. Uranus was first observed in 1781 and is named after the Greek god Uranus. Visited by Voyager 2 in 1986, there is growing interest in further exploration, with the proposed Uranus Orbiter and Probe mission a top priority in planetary science."
    },
    "neptune": {
        "video": "https://images.nasa.gov/details/JPL-19890825-VOYAGEf-0001-AVC2002151%20First%20Spacecraft%20at%20Neptune",
        "description": "Neptune, the eighth planet in the Solar System and the most distant recognized by the International Astronomical Union, is known for its remote and enigmatic nature. It is the fourth-largest planet by diameter and the densest among the gas giants. With a mass 17 times that of Earth, Neptune orbits the Sun at a distance of 30.1 astronomical units, making it the farthest known planet. Discovered through mathematical predictions, Neptune has a complex atmosphere, distinctive blue color, and active weather patterns, including the Great Dark Spot. It is renowned for its strong, sustained winds, making it the windiest planet in the Solar System, and its extremely cold outer atmosphere. Neptune hosts a faint and fragmented ring system, identified in 1984 and confirmed by Voyager 2."
    },
    "pluto": {
        "video": "https://images.nasa.gov/details/130_CountdownToPluto",
        "description": "Pluto, with its minor-planet designation 134340, is a dwarf planet situated in the Kuiper belt, a region of celestial bodies beyond Neptune's orbit. It's known for being the ninth-largest and the tenth-most-massive object directly orbiting the Sun. Although it holds the title of the largest trans-Neptunian object in terms of volume, it's slightly less massive than Eris. Pluto is primarily composed of ice and rock and is significantly smaller than the inner planets. Its five known moons, including Charon, sometimes form a binary system with Pluto due to their unique orbits. The New Horizons mission provided in-depth insights into Pluto and its moons during a flyby in July 2015. Pluto's classification has evolved over time, from its discovery by Clyde W. Tombaugh in 1930 as the ninth planet to its current status as a dwarf planet, redefined by the International Astronomical Union in 2006. The debate about Pluto's planetary status continues among astronomers."
    },
    "sun": {
        "video": "https://images.nasa.gov/details/GSFC_20141222_SDO_m11721_Lights",
        "description": "The Sun is the central star of the Solar System, a massive, hot ball of plasma fueled by nuclear fusion reactions at its core. It emits light, ultraviolet, and infrared radiation, providing the primary energy source for life on Earth. The Sun is located approximately 26,660 light-years away from the Galactic Center of the Milky Way and is about 1 astronomical unit (1.496×108 km) or 8 light-minutes away from Earth. It has a diameter of about 1,391,400 km, making it 109 times larger than Earth. The Sun's mass is approximately 330,000 times that of Earth and accounts for nearly 99.86% of the total mass of the Solar System. It primarily consists of hydrogen (about 73%) and helium (around 25%), with trace amounts of other elements. The Sun is a G-type main-sequence star, often called a yellow dwarf, even though its light appears white. It formed about 4.6 billion years ago from the collapse of matter within a molecular cloud and has been generating energy through nuclear fusion ever since. Every second, it converts about 600 million tons of hydrogen into helium, producing light and heat. In the distant future, the Sun will transform into a red giant and eventually into a white dwarf, no longer generating energy by fusion but still emitting heat and light. Throughout history, the Sun's significant impact on Earth has led various cultures to view it as a deity, and its motions in relation to our planet serve as the basis for many solar calendars, including the widely used Gregorian calendar."
    },
    "asteroid belt": {
        "video": "https://www.youtube.com/watch?v=vD-jbm79kUE&ab_channel=Cosmoknowledge",
        "description": "The asteroid belt, situated between Mars and Jupiter, is a region in the Solar System that hosts countless rocky objects known as asteroids. These asteroids are smaller than planets, with varying sizes and significant distances separating them. It's often called the main asteroid belt. Four prominent asteroids, Ceres, Vesta, Pallas, and Hygiea, account for a majority of its mass. Ceres, the largest, qualifies as a dwarf planet. This belt formed from the remnants of planetesimals, precursors to planets, with gravitational disturbances from Jupiter preventing their planet formation. The asteroids come in different types, classified by their spectra: carbonaceous (C-type), silicate (S-type), and metal-rich (M-type). Despite the sparsity of asteroids, collisions occur, forming asteroid families. These objects are continually affected by Jupiter's gravity, leading to Kirkwood gaps, empty regions within the belt due to orbital resonances with Jupiter."
    }
}